# coding=UTF-8


import json
from support.common.maker import BaseLoader


class RuleGroupLoader(BaseLoader):

    def generate(self):
        return [
            {
                'name': '管理员',
                'describe': "超级角色",
                'organization': "公司",
                "platform": "橙鹿教育CRM总控平台",
                'company': "橙鹿教育科技（湖北）有限公司",
                'content': json.dumps([
                    '所有权限-组织结构-权限组管理-查询',
                    '所有权限-组织结构-权限组管理-添加',
                    '所有权限-组织结构-权限组管理-删除',
                    '所有权限-组织结构-权限组管理-修改',
                    '所有权限-组织结构-职位管理-查询',
                    '所有权限-组织结构-职位管理-删除',
                    '所有权限-组织结构-职位管理-添加',
                    '所有权限-组织结构-职位管理-修改',
                    '所有权限-组织结构-部门管理-查询',
                    '所有权限-组织结构-部门管理-删除',
                    '所有权限-组织结构-部门管理-添加',
                    '所有权限-组织结构-部门管理-修改',
                    '所有权限-组织结构-员工列表-查询',
                    '所有权限-组织结构-员工列表-添加',
                    '所有权限-组织结构-员工列表-修改',
                    '所有权限-组织结构-员工列表-修改账号',
                    '所有权限-组织结构-员工列表-修改部门',

                    '所有权限-客户管理-客户列表-查询',
                    '所有权限-客户管理-客户列表-详情',

                    '所有权限-产品管理-品牌列表-添加',
                    '所有权限-产品管理-品牌列表-修改',
                    '所有权限-产品管理-品牌列表-查询',
                    '所有权限-产品管理-品牌列表-删除',

                    '所有权限-产品管理-产品列表-添加',
                    '所有权限-产品管理-产品列表-修改',
                    '所有权限-产品管理-产品列表-查询',
                    '所有权限-产品管理-产品列表-删除',

                    '所有权限-商品管理-商品列表-查询',
                    '所有权限-商品管理-商品列表-详情',

                    '所有权限-商品管理-商品审核-查询',
                    '所有权限-商品管理-商品审核-详情',

                    '所有权限-商品管理-学校列表-添加',
                    '所有权限-商品管理-学校列表-修改',
                    '所有权限-商品管理-学校列表-查询',
                    '所有权限-商品管理-学校列表-删除',
                    '所有权限-商品管理-学校列表-详情',
                    '所有权限-商品管理-学校列表-置顶',

                    '所有权限-商品管理-专业列表-添加',
                    '所有权限-商品管理-专业列表-修改',
                    '所有权限-商品管理-专业列表-查询',
                    '所有权限-商品管理-专业列表-删除',
                    '所有权限-商品管理-专业列表-置顶',

                    '所有权限-合同管理-合同参数管理-添加',
                    '所有权限-合同管理-合同参数管理-修改',
                    '所有权限-合同管理-合同参数管理-查询',
                    '所有权限-合同管理-合同参数管理-删除',

                    '所有权限-合同管理-合同模板-查询',
                    '所有权限-合同管理-合同模板-预览',

                    '所有权限-短信列表-短信列表子项-查询',

                    '所有权限-订单管理-订单列表-查询',
                    '所有权限-订单管理-订单列表-详情',
                    '所有权限-订单管理-合同列表-查询',

                    '所有权限-代理商-代理商列表-添加',
                    '所有权限-代理商-代理商列表-修改',
                    '所有权限-代理商-代理商列表-查询',
                    '所有权限-代理商-代理商列表-详情',

                    '所有权限-广告管理-广告位管理-添加',
                    '所有权限-广告管理-广告位管理-修改',
                    '所有权限-广告管理-广告位管理-查询',

                    '所有权限-广告管理-广告管理子项-添加',
                    '所有权限-广告管理-广告管理子项-修改',
                    '所有权限-广告管理-广告管理子项-查询',
                    '所有权限-广告管理-广告管理子项-删除',

                    '所有权限-公告消息-公告消息子项-添加',
                    '所有权限-公告消息-公告消息子项-修改',
                    '所有权限-公告消息-公告消息子项-查询',
                    '所有权限-公告消息-公告消息子项-删除',

                    '所有权限-意见反馈-意见反馈子项-修改',
                    '所有权限-意见反馈-意见反馈子项-查询',

                    '所有权限-系统设置-系统设置子项-修改',
                    '所有权限-系统设置-系统设置子项-查询',
                ]),
                'description': '超级角色',
                'remark': '管理一切权限'
            },
            {
                'name': '人事管理员',
                'describe': "超级角色",
                'organization': "公司",
                "platform": "橙鹿教育CRM总控平台",
                'company': "橙鹿教育科技（湖北）有限公司",
                'content': json.dumps([
                    '所有权限-组织结构-权限组管理-查询',
                    '所有权限-组织结构-权限组管理-添加',
                    '所有权限-组织结构-权限组管理-删除',
                    '所有权限-组织结构-权限组管理-修改',
                    '所有权限-组织结构-职位管理-查询',
                    '所有权限-组织结构-职位管理-删除',
                    '所有权限-组织结构-职位管理-添加',
                    '所有权限-组织结构-职位管理-修改',
                    '所有权限-组织结构-部门管理-查询',
                    '所有权限-组织结构-部门管理-删除',
                    '所有权限-组织结构-部门管理-添加',
                    '所有权限-组织结构-部门管理-修改',
                    '所有权限-组织结构-员工列表-查询',
                    '所有权限-组织结构-员工列表-添加',
                    '所有权限-组织结构-员工列表-修改',
                ]),
                'description': '人事管理',
                'remark': '管理人事相关， 如：职位、部门、员工'
            },
        ]
