# coding=UTF-8

import datetime
from support.common.maker import BaseLoader


class SchoolLoader(BaseLoader):

    def generate(self):
        return [{
                    'name': '武汉理工大学',
                    'logo_url': '/resource/school/武汉理工大学.png',
                    'content': '武汉理工大学是中华人民共和国教育部直属全国重点大学，首批国家世界一流学科建设高校，首批国家“211工程”建设高校，由教育部和交通运输部、国家国防科技工业局共建，入选985工程优势学科创新平台、“111计划”、卓越工程师教育培养计划、国家建设高水平大学公派研究生项目、新工科研究与实践项目、中国政府奖学金来华留学生接收院校、国家大学生文化素质教育基地。',
                    'province': '湖北省',
                    'city': '武汉市',
                    'is_hot': True,
                },
                {
                    'name': '中国地质大学',
                    'logo_url': '/resource/school/中国地质大学.png',
                    'content': '中国地质大学，简称地大，位于武汉市，是中华人民共和国教育部直属全国重点大学，是国家“世界一流学科建设高校”，国家“211工程”、“985工程优势学科创新平台”建设高校，是国家批准设立研究生院的大学，入选国家“111计划”、卓越工程师教育培养计划、国家建设高水平大学公派研究生项目、中国政府奖学金来华留学生接收院校、首批高等学校科技成果转化和技术转移基地，高水平行业特色大学优质资源共享联盟、地球科学国际大学联盟、中国高校行星科学联盟、“七校联合办学”重要成员。学校以地球科学为主要特色，涵盖理、工、文、管、经、法、教育、艺术等学科门类，被誉为“中国地球科学的最高学府”。中国地质大学创建于1952年，前身是北京大学、清华大学、天津大学、唐山铁道学院等校的地质、工程等系科合并组建的北京地质学院。于1960年被中央确定为全国重点高校。文革时期外迁。1975年整体迁至武汉，更名为武汉地质学院。1987年，国家教委批准武汉地质学院更名为中国地质大学，在武汉、北京两地办学，总部设在武汉。2000年，进入教育部直属高校序列。2006年，教育部、原国土资源部签署共建中国地质大学协议。截至2019年11月，学校有南望山校区、未来城校区，占地总面积1435545平方米，校舍总面积807575平方米；设有23个学院（所）、65个本科专业；有教职员工3225人，全日制在校学生28635人；有16个一级学科博士点，34个一级学科硕士点，15个博士后科研流动站；有10个专业学位授予权。',
                    'province': '湖北省',
                    'city': '武汉市',
                    'is_hot': True,
                },
                {
                    'name': '中南财经政法大学',
                    'logo_url': '/resource/school/中南财经政法大学.png',
                    'content': '中南财经政法大学（Zhongnan University of Economics and Law）是中华人民共和国教育部直属的一所以经济学、法学、管理学为主干，兼有哲学、文学、历史学、理学、工学、艺术学等九大学科门类的重点大学，由教育部、财政部和湖北省人民政府三方共建，是国家“211工程”、“985工程优势学科创新平台”项目重点建设高校，是国家“世界一流学科建设高校”，入选国家“2011计划”、“111计划”、教育部人文社会科学重点研究基地、国家建设高水平大学公派研究生项目、卓越法律人才教育培养计划、国家级大学生创新创业训练计划、新工科研究与实践项目、中国政府奖学金来华留学生接收院校、全国毕业生就业典型经验高校、全国高校实践育人创新创业基地、湖北省2011计划，财经一流学科建设联盟理事长单位，立格联盟、中国-俄罗斯经济类大学联盟、中俄“长江-伏尔加河”两河流域高校联盟成员，中国注册会计师考试阅卷中心，中国大陆第七所AMBA、CFA协会认证院校。学校源于1948年以邓小平为第一书记的中共中央中原局创建、并由陈毅担任筹委会主任的中原大学。2000年，原隶属于财政部的中南财经大学和原隶属司法部的中南政法学院合并组建为中南财经政法大学。截至2019年12月，学校占地2800余亩，建筑面积110万余平方米；图书馆有图文藏书854万余册；下设19个学院；有教职工2500余人，其中专任教师1500余人；有全日制本科生20000余人，硕士研究生8000余人，博士研究生1300余人。',
                    'province': '湖北省',
                    'city': '武汉市',
                    'is_hot': True,
                },
                {
                    'name': '湖北大学',
                    'logo_url': '/resource/school/湖北大学.png',
                    'content': '湖北大学（Hubei University）简称“湖大” ，是中华人民共和国教育部与湖北省人民政府共建的省属重点综合性大学，位列湖北省“双一流”建设高校，入选国家“中西部高校基础能力建设工程”、“111计划”、湖北省2011计划、国家级新工科研究与实践项目、数据中国“百校工程”，是全国深化创新创业教育改革示范高校、中国政府奖学金来华留学生接收院校。  截至2020年5月，学校有武昌主校区、汉口校区、阳逻校区等3个校区，总占地面积2100余亩，校舍总建筑面积71万平方米，固定资产15.5亿元、教学科研仪器设备总值4.73亿元；有18个学科性学院，本科专业78个，9个博士学位授权一级学科、6个博士后科研流动站，27个硕士学位授权一级学科，19个硕士专业学位授权类别；有在校普通全日制本专科生1.9万余人，博士、硕士研究生6000余人，专任教师1500人。',
                    'province': '湖北省',
                    'city': '武汉市',
                    'is_hot': True,
                },
                {
                    'name': '湖北工业大学',
                    'logo_url': '/resource/school/湖北工业大学.png',
                    'content': '湖北工业大学（Hubei University of Technology），简称“湖工大”，坐落于国家中心城市——武汉，是一所以工学为特色，覆盖工、文、理、艺、经、管、法和教育等八大学科门类的多科性大学，是湖北省重点建设高校、湖北省“2011计划”牵头高校、湖北省国内一流学科建设高校  、武器装备科研生产单位二级保密资质认证高校，入选国家“中西部高校基础能力建设工程、111计划”高校，教育部“卓越工程师教育培养计划、卓越教师培养计划、百校工程”高校，被教育部评为“高等学校本科教学工作水平评估优秀高校、全国毕业生就业典型经验高校、全国创新创业典型经验高校、全国首批深化创新创业教育改革示范高校”。',
                    'province': '湖北省',
                    'city': '武汉市',
                    'is_hot': True,
                },
                {
                    'name': '湖北师范大学',
                    'logo_url': '/resource/school/湖北师范大学.png',
                    'content': '湖北师范大学（Hubei Normal University）位于黄石市，是一所以人文学科、社会学科、理学、工学为重点，以教师教育为特色，以服务基础教育为主体的省属综合性重点师范类本科院校，拥有硕士学位授予权，是国家产教融合发展工程应用型本科建设高校、湖北省国内“双一流”建设高校、“湖北省高等学校创新能力提升计划”（湖北省2011计划）入选高校。 [1] 湖北师范大学的前身为华中师范学院黄石分院，创建于1973年4月；1978年12月，经国务院批准，学校更名为黄石师范学院；1985年2月，湖北省人民政府决定，学校改名为湖北师范学院；2006年，学校获得硕士学位授予权；2016年3月，教育部正式批准同意湖北师范学院更名为湖北师范大学。截至2019年11月，湖北师范大学规划占地2002亩，校舍总面积60余万平方米；设有20个教学科研单位，开设70个本科专业；拥有11个一级学科硕士点（截至2020年7月），7个专业学位硕士点，有专任教师965人，有全日制在校生2万余人。',
                    'province': '湖北省',
                    'city': '武汉市',
                    'is_hot': True,
                },
                {
                    'name': '武汉工程大学',
                    'logo_url': '/resource/school/武汉工程大学.png',
                    'content': '武汉工程大学是一所以工为主，覆盖工、理、管、经、文、法、艺术、医学、教育学等九大学科门类的多科性教学研究型大学，是湖北省重点建设高校、湖北省国内一流学科建设高校，入选卓越工程师教育培养计划、中西部高校基础能力建设工程、“新工科”研究与实践项目。学校创建于1972年6月，原名湖北化工石油学院，隶属湖北省人民政府。1980年3月，更名为武汉化工学院，改由原化工部主管。1998年7月，学校划归湖北省人民政府管理，实行中央与地方共建。2006年2月，更名为武汉工程大学。 截至2019年4月，学校有武昌和流芳两个校区，共占地约130.8万平方米，校舍建筑面积92.6万平方米，固定资产17.4亿元，教学仪器设备总值3.4亿元，图书馆馆藏图书（含电子图书）300余万册；有在职教职工2038人，其中专职教学科研人员1226人；全日制在校生21789人，其中研究生3339人（全日制研究生2911人），普通本科生18878人，留学生25人；设有17个二级学院、64个本科专业，有2个一级学科博士点、21个一级学科硕士点。',
                    'province': '湖北省',
                    'city': '武汉市',
                    'is_hot': True,
                },
                {
                    'name': '武汉科技大学',
                    'logo_url': '/resource/school/武汉科技大学.png',
                    'content': '武汉科技大学（Wuhan University of Science and Technology）简称“武科大”，坐落于湖北省武汉市，是湖北省人民政府举办的全日制普通高等学校，由湖北省人民政府和中华人民共和国教育部共同建设，入选国家中西部高校基础能力建设工程、高等学校学科创新引智计划、教育部卓越工程师教育培养计划、是教育部高等学校科技成果转化和技术转移基地、科技部国家创新人才培养示范基地。 [1-3] 学校历史可溯源至1898年成立的湖北工艺学堂；1958年组建为武汉钢铁学院，开办本科教育；1995年，隶属于原国家冶金工业部的武汉钢铁学院、武汉建筑高等专科学校、武汉冶金医学高等专科学校合并组建为武汉冶金科技大学；1999年，更名为武汉科技大学。2013年，学校由湖北省人民政府、教育部、宝钢集团有限公司、鞍山钢铁集团公司、武汉钢铁（集团）公司、首钢总公司、中国冶金科工集团有限公司、中国中钢集团公司共建。截至2020年5月，学校有青山、黄家湖和洪山三个校区，校园总面积171.43万平方米，校舍建筑面积123.63万平方米；有20个二级学院，开设77个本科专业；有8个博士后科研流动站，8个一级学科博士学位授权点，33个一级学科硕士学位授权点，18个硕士专业学位授权类别；有教职工2600余人，全日制普通本科生24000余人，博士、硕士研究生6000余人。',
                    'province': '湖北省',
                    'city': '武汉市',
                    'is_hot': True,
                },
                {
                    'name': '长江大学',
                    'logo_url': '/resource/school/长江大学.png',
                    'content': '长江大学，简称“长大”，国家“小211工程”（中西部高校基础能力建设工程）重点建设大学，教育部卓越工程师教育培训计划，卓越农林人才教育培训计划，卓越医生教育培训计划改革试点高校，位于历史文化名城湖北荆州，并在武汉建有教学科研基地，隶属于湖北省教育厅，是湖北省属高校中规模最大、学科门类较全的综合性大学，为湖北省重点建设的骨干高校，湖北省园林式高等学校。长江大学与2003年4月14日由江汉石油学院、湖北农学院、荆州师范学院、湖北省卫生职工医学院并组建而成，是湖北省人民政府与中国石油天然气集团公司、中国石油化工集团公司、中国海洋石油总公司共建和湖北省人民政府与国家农业部共建高校。',
                    'province': '湖北省',
                    'city': '武汉市',
                    'is_hot': True,
                }
        ]
